* flutter
** all sources are taken from nixpkgs/pkgs/*
=~/SRC/GITHUB/nixpkgs/pkgs/build-support/flutter=
=~/SRC/GITHUB/nixpkgs/pkgs/development/compilers/flutter=
=~/SRC/GITHUB/nixpkgs/pkgs/build-support/fetchgit/deterministic-git=
*** current version
 22.05
** diff
*** compiler
#+BEGIN_SRC shell :results verbatim
  diff -ur ./development/compilers/flutter ~/SRC/GITHUB/nixpkgs/pkgs/development/compilers/flutter || true
#+END_SRC

#+RESULTS:
#+begin_example
diff -ur ./development/compilers/flutter/flutter.nix /home/frank/SRC/GITHUB/nixpkgs/pkgs/development/compilers/flutter/flutter.nix
--- ./development/compilers/flutter/flutter.nix	2022-07-02 08:39:15.220524612 +0200
+++ /home/frank/SRC/GITHUB/nixpkgs/pkgs/development/compilers/flutter/flutter.nix	2022-05-31 17:11:50.592065125 +0200
@@ -1,5 +1,3 @@
-### ${dart}/bin/pub get --offline
-### ${dart}/bin/dart pub get --offline
 { pname
 , version
 , patches
@@ -63,7 +61,7 @@
                  # path is relative otherwise it's replaced by /build/flutter
 
       pushd "$FLUTTER_TOOLS_DIR"
-      ${dart}/bin/dart pub get --offline
+      ${dart}/bin/pub get --offline
       popd
 
       local revision="$(cd "$FLUTTER_ROOT"; git rev-parse HEAD)"
#+end_example

*** build-support
#+BEGIN_SRC shell :results verbatim
  diff -ur ./build-support/flutter ~/SRC/GITHUB/nixpkgs/pkgs/build-support/flutter || true
#+END_SRC

#+RESULTS:

*** fetchgit
#+BEGIN_SRC shell :results verbatim
  diff -ur ./build-support/fetchgit/deterministic-git ~/SRC/GITHUB/nixpkgs/pkgs/build-support/fetchgit/deterministic-git || true
#+END_SRC

#+RESULTS:
